Repository: doc-br/freebsd-manpages
Catalog: man8/*/tcpdrop.8.po
Languages: pt_br

source: September 15, 2017
pt_br: 15 de setembro de 2017

source: NAME
pt_br: NOME

source: drop TCP connections
pt_br: Descartar conexões TCP

source: SYNOPSIS
pt_br: SINOPSE

source: DESCRIPTION
pt_br: DESCRIÇÃO

source: The E<.Nm> command may be used to drop TCP connections from the command line.
pt_br: O comando E<.Nm> pode ser usado para descartar conexões TCP utilizando a linha de comando.

source: If E<.Fl a> is specified then E<.Nm> will attempt to drop all TCP connections.
pt_br: Se E<.Fl a> for especificado, o E<.Nm> tentará descartar todas as conexões TCP.

source: If E<.Fl S Ar stack> is specified then E<.Nm> will attempt to drop all connections using the TCP stack E<.Ar stack>.
pt_br: Se E<.Fl S Ar stack> for especificado, então o E<.Nm> tentará eliminar todas as conexões usando TCP stack E<.Ar stack>.

source: If E<.Fl s Ar state> is specified then E<.Nm> will attempt to drop all TCP connections being in the state E<.Ar state>. E<.Ar state> is one of E<.Dv SYN_SENT>, E<.Dv SYN_RCVD>, E<.Dv ESTABLISHED>, E<.Dv CLOSE_WAIT>, E<.Dv FIN_WAIT_1>, E<.Dv CLOSING>, E<.Dv LAST_ACK>, E<.Dv FIN_WAIT_2 , or> E<.Dv TIME_WAIT>.
pt_br: Se E<.Fl s Ar state> for especificado, então o E<.Nm> tentará eliminar todos as conexões TCP que estão com estado E<.Ar state>. E<.Ar state> é um dos E<.Dv SYN_SENT>, E<.Dv SYN_RCVD>, E<.Dv ESTABLISHED>, E<.Dv CLOSE_WAIT>, E<.Dv FIN_WAIT_1>, E<.Dv CLOSING>, E<.Dv LAST_ACK>, E<.Dv FIN_WAIT_2 , or> E<.Dv TIME_WAIT>.

source: If E<.Fl S Ar stack> and E<.Fl s Ar state> are specified, E<.Nm> will attempt to drop all TCP connections being in the state E<.Ar state> and using the TCP stack E<.Ar stack>. Since TCP connections in the E<.Dv TIME_WAIT> state are not tied to any TCP stack, using the option E<.Fl s Dv TIME_WAIT> in combination with the E<.Fl S Ar stack> option results in E<.Nm> not dropping any TCP connection.
pt_br: Se E<.Fl S Ar stack> e E<.Fl s Ar state> forem especificados, o E<.Nm> tentará eliminar todas as conexões TCP com o estado E<.Ar state> e usando TCP stack E<.Ar stack>. Como as conexões TCP no estado E<.Dv TIME_WAIT> não estão vinculadas a nenhum TCP stack, usando a opção E<.Fl s Dv TIME_WAIT> em combinação com E<.Fl S Ar stack> resultará no E<.Nm> não descartando nenhuma conexão TCP.

source: The E<.Fl l> flag may be given in addition to the E<.Fl a>, E<.Fl S>, or E<.Fl s> options to list the tcpdrop invocation to drop all corresponding TCP connections one at a time.
pt_br: O sinalizador E<.Fl l> pode ser utilizado juntamente com as opções E<.Fl a>, E<.Fl S>, ou E<.Fl s> para o tcpdrop descartar todas as conexões TCP correspondentes, uma por vez.

source: If none of the E<.Fl a>, E<.Fl S>, or E<.Fl s> options are specified then only the connection between the given local address E<.Ar local-address>, port E<.Ar local-port>, and the foreign address E<.Ar foreign-address>, port E<.Ar foreign-port>, will be dropped.
pt_br: Se nenhuma das opções E<.Fl a>, E<.Fl S>, ou E<.Fl s> forem especificadas, apenas a conexão entre o endereço local fornecido E<.Ar local-address>, porta E<.Ar local-port>, e o endereço externo E<.Ar foreign-address>, porta E<.Ar foreign-port>,será descartada.

source: Addresses and ports may be specified by name or numeric value. Both IPv4 and IPv6 address formats are supported.
pt_br: Endereços e portas podem ser especificados por nome ou valor numérico. Ambos os formatos de endereço IPv4 e IPv6 são suportados.

source: The addresses and ports may be separated by periods or colons instead of spaces.
pt_br: Os endereços e portas podem ser separados por pontos ou dois pontos em vez de espaços.

source: EXAMPLES
pt_br: EXEMPLOS

source: If a connection to E<.Xr httpd 8> is causing congestion on a network link, one can drop the TCP session in charge:
pt_br: Se uma conexão para E<.Xr httpd 8> estiver causando congestionamento em um link de rede, pode-se eliminar a sessão TCP responsável:

source: The following command will drop the connection:
pt_br: O comando a seguir desconectará a conexão:

source: The following command will drop all connections but those to or from port 22, the port used by E<.Xr sshd 8>:
pt_br: O comando a seguir desconectará todas as conexões, exceto as conexões de ou para a porta 22, a porta usada pelo E<.Xr sshd 8>:

source: The following command will drop all connections using the TCP stack fastack:
pt_br: O comando a seguir desconectará todas as conexões usando o TCP stack fastack:

source: To drop all TCP connections in the LAST_ACK state use:
pt_br: Para descartar todas as conexões TCP no estado LAST_ACK, utilize:

source: To drop all TCP connections using the TCP stack fastack and being in the LAST_ACK state use:
pt_br: Para descartar todas as conexões TCP utilizando o TCP stack fastack e estão no estado LAST_ACK, utilize:

source: SEE ALSO
pt_br: VEJA TAMBÉM

source: AUTHORS
pt_br: AUTORES
